tutorials/fluidSolidInteraction-preCICE/flexibleOversetCylinder/fluid/cylinderAndBackground/system/preciceDict
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.0                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      preciceDict;
}
preciceConfig "../../precice-config.xml";

participant Fluid;

modules (FSI);

interfaces
{
  Interface1
  {
    mesh              Fluid-Mesh;
    patches           (walls);
    locations         faceCenters;

    readData
    (
      Displacement
    );

    writeData
    (
      Force
    );
  };
};

FSI
{
  rho rho [1 -3 0 0 0 0 0] 1;
}
